Repository: 84000/data-translation-memory
Catalog: toh67-v3.tmx
Source language: bo
Languages: en

source: དགེ་སློང་དག་ཁྱེད་ཀྱིས་ཇི་ལྟ་ཇི་ལྟར་སྦྱོར་བ་དང་། འབད་པ་དང་། རྩོལ་བར་བྱེད་པ་ན་ཆོས་འགའ་ཡང་སྦྱོར་བར་མི་བྱེད། ཆོས་འགའ་ཡང་འབྱེད་པར་མི་བྱེད་པ་དང་། ཆོས་འགའ་ཡང་སྐྱེད་པར་མི་བྱེད།
en: Mañjuśrī said, “Monks, however you practice, strive, and exert yourselves, do not practice anything at all, discern anything at all, create anything at all, or put a stop to anything at all.

source: ཆོས་འགའ་ཡང་འགོག་པར་མི་བྱེད་པ་དང་། ཆོས་འགའ་ཡང་ཐོབ་པར་མི་བྱེད། ཆོས་འགའ་ཡང་སྤོང་བར་མི་བྱེད་པ་དང་། ཆོས་འགའ་ཡང་འབྲི་བར་མི་བྱེད། ཆོས་འགའ་ཡང་འཕེལ་བར་མི་བྱེད་པ་དེ་ལྟར་སྦྱོར་བར་གྱིས་ཤིག །
en: Do not attain anything at all or renounce anything at all; do not decrease anything at all or increase anything at all.

source: དགེ་སློང་གང་དེ་ལྟར་སྦྱོར་བ་དེ་ནི་ཆོས་འགའ་ཡང་རྟོགས་པར་མི་འགྱུར་རོ།
en: Practice like that. Any monk who practices like that does not understand anything at all.

source: །གང་ཆོས་འགའ་ཡང་རྟོགས་པར་མི་འགྱུར་བ་དེ་ནི་གར་ཡང་མི་འགྲོ །གང་ནས་ཀྱང་མི་འོང་ངོ་།
en: Whoever does not understand anything at all does not go anywhere at all and does not come from anywhere at all.

source: །གང་ལ་འགྲོ་བ་མེད་པ་དེ་ལ་ཡང་ནི་འོང་བ་ཡང་འགའ་ཡང་མེད་དོ།
en: For whom there is no going there is also no coming at all.

source: །དེ་ནི་འོང་བ་མེད་པ་དང་། འགྲོ་བ་མེད་པའི་དགེ་སློང་ཞེས་བྱ་སྟེ།
en: That is called a monk who has no coming or going.

source: གང་དུ་ཡང་རྟེན་པ་ཡང་མ་ཡིན། མི་རྟེན་པ་ཡང་མ་ཡིན་ནོ།
en: He is neither sustained anywhere nor not sustained anywhere.”

source: །བསྟན་པ་འདི་བཤད་པ་ན་དགེ་སློང་ལྔ་བརྒྱ་པོ་དེ་དག་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ།
en: As soon as this teaching was expounded, the minds of the five hundred monks were liberated from their defilements without further appropriation.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་གནས་བརྟན་འོད་སྲུང་ཆེན་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སླད་མའི་ཚེ་སླད་མའི་དུས་ལྔ་བརྒྱ་པ་ཐ་མ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་འཆོས་པ་ཇི་སྙེད་ཅིག་འབྱུང་བར་འགྱུར་ལགས།
en: Then the elder Mahākāśyapa said to the Blessed One, “Blessed One, in the future, in the final five-hundred-year period, how many sham bodhisattvas will there be?”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འོད་སྲུང་གང་དག་སྡིག་པའི་གྲོགས་པོས་ཡོངས་སུ་ཟིན་ཅིང་ལྷག་པའི་བསམ་པ་ཉམ་ཆུང་སྟེ། ཟས་དང་གོས་ལྷུར་ལེན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་འཆོས་པ་དག་ནི་མང་དུ་འབྱུང་བར་འགྱུར་རོ།
en: The Blessed One replied, “Kāśyapa, there will be many sham bodhisattvas in the clutches of sinful friends, whose noble intention will be weak and who will be intent only on food and clothing.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་གནས་བརྟན་འོད་སྲུང་ཆེན་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བའི་སླད་དུ་གནས་གང་དག་དང་། སྤྱོད་པ་གང་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ལྷག་པའི་བསམ་པ་ཉམ་ཆུང་བ་དང་། ཚུལ་འཆོས་པ་ལགས་པར་འཚལ་བར་འགྱུར་བའི་གནས་དེ་དག་ལེགས་པ་ལེགས་པར་བཤད་དུ་གསོལ།
en: Then the elder Mahākāśyapa said to the Blessed One, “Blessed One, for the benefit of many beings and for the happiness of many beings, please explain to us the state and the conduct that will cause bodhisattvas to be of weak noble intention and a sham.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་འདི་ལྟར་གནས་དེ་དག་ཐོས་ན། བྱང་ཆུབ་སེམས་དཔའ་ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པ་གང་ལགས་པ་དེ་དག་ཀྱང་བདག་ཉིད་སྲུང་བར་འགྱུར་བའི་སླད་དུའོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Blessed One, this is so that when they learn about those states in this way, even those bodhisattvas whose noble intention is perfect will guard themselves.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་གནས་བརྟན་འོད་སྲུང་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །འོད་སྲུང་ཕྱི་མའི་ཚེ་ཕྱི་མའི་དུས་ལྔ་བརྒྱ་པ་ཐ་མ་དེ་ལ། བྱང་ཆུབ་སེམས་དཔའ་གང་དག་སྡིག་པའི་གྲོགས་པོས་ཡོངས་སུ་ཟིན་ཅིང་ལྷག་པའི་བསམ་པ་ཉམ་ཆུང་བ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་རྣམས་ལ་མེ་ཏོག་དང་། བདུག་པ་དང་། ཕྱེ་མ་དང་། སྤོས་དང་། མེ་ཏོག་ཕྲེང་བ་དང་། བྱུག་པ་དང་། གདུགས་དང་།
en: The Blessed One then said to the elder Mahākāśyapa, “Kāśyapa, in the future, in the final five-hundred-year period, those bodhisattvas in the clutches of sinful friends, whose noble intention is weak, will exert themselves in the act of making offerings of flowers, incense, powders, perfumes, garlands, ointments, parasols, victory banners, pennants, cymbals, and lamps to the bodily relics of the Tathāgata.

source: རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་དང་། མར་མེའི་སྦྱིན་པ་ངག་གིས་མཆོད་པའི་ལས་ལ་བརྩོན་པར་འགྱུར་རོ། །འོད་སྲུང་ངས་ནི་ཤེས་པ་དང་མི་ལྡན་པ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ཡང་དག་པར་བསྒྲུབ་པའི་ཕྱིར་མཆོད་པ་བཤད་པ་ཡིན་ན་མི་བླུན་པོ་དེ་དག་ནི་དེ་ལ་བརྩོན་པར་འགྱུར་རོ།
en: Kāśyapa, since I explained the making of offerings in order for those who lack understanding to accomplish roots of virtue, those foolish people exert themselves in that. “

source: །འོད་སྲུང་ངས་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་མདུན་དུ་དགེ་སློང་དག་ཁྱེད་ཅག་ནི་བདག་ཉིད་དུལ་བ་དང་། ཞི་བར་སྦྱོར་བའི་རྗེས་སུ་བརྩོན་པས་གནས་པར་གྱིས་ཤིག །
en: Kāśyapa, in the presence of the world with its gods, I have said, ‘I tell you, monks: assiduously discipline and calm yourselves.

source: བྲམ་ཟེ་དང་ཁྱིམ་བདག་དད་པ་དང་ལྡན་པ་དག་ཡོད་ན་དེ་དག་ནི་ངའི་སྐུ་གདུང་རྣམས་ལ་སྐུ་གདུང་གི་མཆོད་པ་བྱེད་པར་འགྱུར་རོ། །ཞེས་དེ་སྐད་གསུངས་ན།
en: Since there are brahmins and householders who have faith, it is they who will make offerings to my bodily relics.’ “

source: འོད་སྲུང་མི་བླུན་པོ་དེ་དག་རྣལ་འབྱོར་ཡང་སྤངས། སྤོང་བ་ཡང་སྤངས། ལུང་ནོད་པ་ཡང་སྤངས། ཁ་ཏོན་བྱ་བ་ཡང་སྤངས་ནས། དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་གི་མཆོད་པའི་ལས་ལ་བརྩོན་པར་འགྱུར་ཞིང་དེ་དག་ལ་བརྟེན་ནས་འཚོ་བར་སེམས་པར་བྱེད་པ་དེ་དག་ལ་ལྟོས།
en: But look, Kāśyapa, how those foolish people have given up yoga and renunciation, giving instructions and performing recitations, to exert themselves in the act of making offerings to the bodily relics of the Tathāgata, intending to use them to make a living for themselves! “

source: འོད་སྲུང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཆུའི་ཕུང་པོ་ནས་བཟུང་སྟེ། ཚངས་པའི་འཇིག་རྟེན་གྱི་མཐར་ཐུག་པའི་བར་དུ་འབྲུ་མར་གྱིས་ཡོངས་སུ་བཀང་སྟེ། མར་མེའི་སྙིང་པོ་རི་རབ་ཙམ་བཙུགས་ནས། དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་མར་མེ་བུས་པ་བས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པ།
en: Kāśyapa, suppose a bodhisattva took this great billionfold universe out of the ocean, filled it right up to the realm of Brahmā with oil, placed in it a wick the size of Mount Meru, and then lit the lamp in order to make an offering to the Tathāgata.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ལ་གནས་པ། ཅིག་ཤོས་ཀྱིས་མཁན་པོ་འམ། སློབ་དཔོན་གྱི་དྲུང་ནས་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་གཅིག་ལུང་མནོས་ཏེ། ཁ་ཏོན་བྱེད་ཅིང་གོམ་པ་བདུན་འདོར་བར་བྱེད་པ་གང་ཡིན་པ་དེ་དེ་བས་ཆེས་བསོད་ནམས་མང་དུ་སྐྱེད་པར་འགྱུར་རོ།
en: Another bodhisattva whose noble intention is perfect, who abides by the components of moral discipline, and who receives the transmission of a single four-line verse of Dharma from a preceptor or teacher and recites it while taking seven steps creates much greater merit. “

source: །འོད་སྲུང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་མེ་ཏོག་དང་། བདུག་པ་དང་། ཕྱེ་མ་དང་། སྤོས་ཀྱིས་རབ་ཏུ་བཀང་སྟེ།
en: Kāśyapa, suppose a bodhisattva fills this great billionfold universe with flowers, incense, powders, and perfumes and presents it as an offering to the Tathāgata three times a day and three times a night for a hundred thousand years.

source: དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ལོ་འབུམ་གྱི་བར་དུ་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་ཕུལ་བ་བས་ནི་བྱང་ཆུབ་སེམས་དཔའ་འདུ་འཛིའི་གཏམ་གྱིས་འཇིགས་ཤིང་སྐྲག་པ་གཞན་ཞིག་ཁམས་གསུམ་ཐམས་ཅད་ཀྱིས་འཇིགས་ཤིང་།
en: Another bodhisattva is fearful and anxious of busy chatter and fearful of the whole of the three realms.

source: སེམས་ཅན་གྱི་དོན་མངོན་པར་སྒྲུབ་པ་ན་དགོན་པ་ལ་མངོན་པར་ཕྱོགས་ཏེ། གོམ་པ་བདུན་འདོར་བར་བྱེད་པ་གང་ཡིན་པ་དེ་དེ་བས་ཆེས་བསོད་ནམས་མང་དུ་སྐྱེད་པར་འགྱུར་རོ།
en: To accomplish the benefit of beings, they turn toward a forest and take seven steps in its direction—they create much greater merit. “

source: །འོད་སྲུང་འདི་ཇི་སྙམ་དུ་སེམས།
en: Kāśyapa, what do you think?

source: དེ་བཞིན་གཤེགས་པས་ཀྱལ་ཀའི་ཆེད་དམ། བརྗོད་པའི་ཆེད་དུ་དེ་སྐད་གསུངས་པ་མ་ཡིན་གྲང་སྙམ་ན། འོད་སྲུང་ཁྱེད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: If you think that maybe the Tathāgata has declared this in jest, or for the sake of discussion, Kāśyapa, do not view it like that.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་ང་ལ་མངོན་སུམ་ཡིན་པའི་ཕྱིར་རོ། །འོད་སྲུང་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་དང་། ཆེས་གྲངས་མེད་པ་དང་།
en: It is because I know it directly. “

source: ཆེས་ཤིན་ཏུ་གྲངས་མེད་པ་དང་། རྒྱ་ཆེ་བ་དང་། ཚད་མེད་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པ་དང་། དཔག་ཏུ་མེད་པ་དག་བྱུང་བ་དེའི་ཚེ་དེའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་སྣ་ཚོགས་ཞེས་བྱ་བ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ།
en: Kāśyapa, countless eons ago in the past—exceedingly countless, totally countless, numerous, immeasurable, unimaginable, incalculable eons ago—there arose in the world a tathāgata, an arhat, a completely awakened buddha called Myriad Flowers.

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: He was endowed with perfect knowledge and conduct, a sugata, a knower of the world, a guide of beings to be tamed, unsurpassable, a teacher of gods and humans, a buddha, a blessed one. “

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཤིག་འཇིག་རྟེན་དུ་བྱུང་སྟེ། འོད་སྲུང་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེའི་ཉན་ཐོས་རྣམས་ཀྱི་འདུས་པ་ཆེན་པོ་ནི་བྱེ་བ་འབུམ་ཕྲག་དགུ་བཅུ་རྩ་དྲུག་ཏུ་གྱུར་ཏོ།
en: Kāśyapa, around the Buddha Myriad Flowers there was a great assembly of ninety-six trillion śrāvakas.

source: །འོད་སྲུང་དེའི་ཚེ་དེའི་དུས་ན་གླིང་བཞི་པའི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་མུ་ཁྱུད་ཅེས་བྱ་བ་ཆོས་དང་ལྡན་པ། ཆོས་ཀྱི་རྒྱལ་པོ་ཞིག་བྱུང་བར་གྱུར་ཏེ།
en: Then, at that time, Kāśyapa, there appeared a righteous Dharma king named Nimi, a universal monarch who ruled over the four continents.

source: འོད་སྲུང་རྒྱལ་པོ་མུ་ཁྱུད་དེ་ལ་བུ་ནི་དཔའ་བ། རྟུལ་ཕོད་པ། ཡན་ལག་མཆོག་གི་གཟུགས་དང་ལྡན་པ། ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པར་བྱེད་པ་སྟོང་ཡོད་པར་གྱུར་ཏོ།
en: Kāśyapa, King Nimi had a thousand sons who were brave and heroic, who had excellent well-built bodies, and who subdued opposing armies.

source: །འོད་སྲུང་རྒྱལ་པོ་མུ་ཁྱུད་དེའི་བུ་སྟོང་པོ་དེ་དག་གི་རྗེས་ལ་དེའི་བང་བར་ཆོས་ཞེས་བྱ་བ་དང་། ཆོས་བཟང་ཞེས་བྱ་བའི་ཁྱེའུ་གཉིས་ཤིག་རྫུས་ཏེ་སྐྱེས་པར་གྱུར་ཏོ།
en: Kāśyapa, after the thousand sons of King Nimi, two boys named Dharma and Sudharma were miraculously born in his storehouse. “

source: །འོད་སྲུང་རྒྱལ་པོ་མུ་ཁྱུད་དེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་དེ་ལ་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་རྫོགས་ཀྱི་བར་དུ་ལས་གཞན་མི་བྱེད་པར་ཁྱིམ་གྱི་ཡིད་ལ་བྱེད་པ་ཐམས་ཅད་སྤངས་ཏེ། ན་བཟའ་དང་།
en: Kāśyapa, King Nimi did nothing but honor the Blessed One, the Tathāgata Myriad Flowers, along with his saṅgha of monks, for eighty-four thousand years, giving up all attention to his household.

source: ཞལ་ཟས་དང་། གཟིམས་ཆ་དང་། གདན་དང་། སྙུན་གྱི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་བསྙེན་བཀུར་དུ་བྱས་ཏེ།
en: He served him with clothing, food, bedding, seats, medicines to cure illness, and implements.

source: དགེ་སློང་གི་དགེ་འདུན་རྣམས་ལ་ཡང་ཞག་བདུན་བདུན་འདས་ཤིང་ཆོས་གོས་ཡིད་དུ་འོང་བ་གཞན་དང་གཞན་དག་ཀྱང་ཕུལ་ལོ།
en: He also offered different kinds of attractive monastic robes to the saṅgha of monks every seven days.

source: །གང་དང་གང་དག་ཅི་དང་ཅི་འདོད་པ་དེ་དང་དེ་དག་ལ་ཁ་ཟས་ཀྱི་རྣམ་པ་ཡིད་དུ་འོང་བ་དེ་ལྟ་དེ་ལྟ་བུ་དག་ཀྱང་ཕུལ་ལོ།
en: He also offered them whatever kinds of pleasing food they desired.

source: །གང་དང་གང་དག་ཇི་ལྟ་ཇི་ལྟ་བུ་འདོད་པ་དེ་དང་དེ་དག་གི་གཙུག་ལག་ཁང་ཡིད་དུ་འོང་བ་དེ་ལྟ་དེ་ལྟ་བུ་དག་ཀྱང་བརྩིག་ཏུ་བཅུག་གོ །
en: He had pleasant monasteries built for them in whatever ways they wished.

source: དགེ་སློང་རེ་རེ་ལ་ཡང་འཆག་ས་དང་། སྐྱེད་མོས་ཚལ་དང་། བསྙེན་བཀུར་བ་བདུན་བདུན་དང་། རོ་བརྒྱ་དང་ལྡན་པའི་ཁ་ཟས་དག་ཀྱང་ཕུལ་ལོ།
en: To each monk he offered walking paths, groves, a great many tokens of respect, and foods of a hundred flavors. “

source: །འོད་སྲུང་འདི་ལྟར་རྒྱལ་པོ་མུ་ཁྱུད་དེས་ཁང་བཟངས་ཁོ་ར་ཁོར་ཡུག་ཏུ་དཔག་ཚད་བརྒྱད་ཅུ་ཡོད་པ། ངོས་བཞི་ཁང་མིག་ཅན་ཤིན་ཏུ་འབྲེལ་པ། བཀྲ་བ། བལྟ་ན་སྡུག་པ། ལེགས་པར་བྱས་པ།
en: Kāśyapa, in this way King Nimi ordered the construction of mansions eighty leagues in circumference, with splendid adjoining chambers on all four sides, beautiful to behold, well made, excellently made, and purified with the threads of a yantra.

source: ཤིན་ཏུ་ཟིན་པར་བྱས་པ། འཁྲུལ་འཁོར་གྱི་སྲད་བུས་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་དག་ཀྱང་བྱེད་དུ་བཅུག་སྟེ། གང་གི་ཚེ་དེ་བཞིན་གཤེགས་པ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ཁང་བཟངས་དེ་དག་ན་བཞུགས་པ་དེའི་ཚེ་འཁྲུལ་འཁོར་གྱི་སྲད་བུ་དེ་དག་གི་ཤུགས་ཀྱིས་ཁང་བཟངས་དེ་དག་གི་སྟེང་ནས་མེ་ཏོག་ཁ་དོག་རྣམ་པ་དུ་མའི་ཆར་དག་ཀྱང་འབབ་བོ།
en: And when the Tathāgata, together with the saṅgha of monks, entered those mansions, a rain of many kinds of colored flowers fell from the tops of the mansions through the power of the threads of the yantras.

source: །མེ་ཏོག་དེ་དག་གིས་ཁང་བཟངས་དེ་དག་པུས་མོ་ནུབ་ཙམ་དུ་གང་བར་ཡང་གྱུར་ཏོ།
en: The mansions were filled knee-deep with the flowers. “

source: །འོད་སྲུང་དེ་ལྟར་རྒྱལ་པོ་མུ་ཁྱུད་དེས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་དེ་ལ་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་རྫོགས་ཀྱི་བར་དུ་ཡོན་ཏན་བཀོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དག་དང་། བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བཀུར་སྟིར་བྱས། བླ་མར་བྱས། རི་མོར་བྱས། མཆོད་པ་བྱས་སོ།
en: Kāśyapa, in that way King Nimi paid homage to the Tathāgata Myriad Flowers, together with his saṅgha of monks, for eighty-four thousand years with an unimaginable array of good qualities and every pleasing possession and revered, honored, and made offerings to him. “

source: །འོད་སྲུང་དེ་ནས་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དེ་དག་འདས་པའི་ཕྱི་དེ་ཉིན་པར་དེ་བཞིན་གཤེགས་པ་དེའི་ཞལ་ཟས་ཀྱི་བྱ་བ་མཛད་ལགས་པའི་འོག་ཏུ་ཁྱེའུ་ཆོས་དང་། ཆོས་བཟང་གཉིས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་ཐམས་ཅད་དང་བཅས་ཏེ།
en: Then, Kāśyapa, the day those eighty-four thousand years had passed, after the Tathāgata had eaten his meal, the two boys Dharma and Sudharma, along with all of the four branches of the armed forces, bowed before the tathāgata, the arhat, the completely awakened Buddha Myriad Flowers. “

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་སྣ་ཚོགས་དེའི་སྤྱན་སྔར་བཏུད་ནས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཡིད་ཀྱི་ཞུ་བ་འདི་སྐད་ཅེས་ཡོངས་སུ་ཞུས་སོ། །བཅོམ་ལྡན་འདས་རྒྱལ་པོ་མུ་ཁྱུད་འདིས་ཡུན་རིང་པོ་འདི་སྲིད་དུ་དགེ་བའི་རྩ་བ་བསྐྲུན་པ་རྣམ་པ་མང་པོ་འདི་ལྟ་བུ་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཅིང་ཡོངས་སུ་གཏུགས་ཏེ་གནས་པར་འགྱུར་བའི་སྦྱིན་པ་དང་། བསོད་ནམས་དང་། ལོངས་སྤྱོད་དང་། དགེ་བའི་རྩ་བ་གཞན་ཞིག་མཆིས་ལགས་སམ།
en: They then asked the Tathāgata a question they had in their minds: ‘Blessed One, is there another gift, merit, resource, or root of virtue that surpasses or reaches the end of the many kinds of roots of virtue that King Nimi has produced for such a long time?’ “

source: འོད་སྲུང་དེ་ལྟར་ཁྱེའུ་དེ་གཉིས་ཀྱིས་ཞབས་གཉིས་ལ་གཏུགས་མ་ཐག་ཏུ་དེ་ནས་སྐད་ཅིག་དེ་ལ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་རབ་ཏུ་གཡོས་ཤིང་འཇིག་རྟེན་དུ་ས་གཡོས་པ་ཆེན་པོ་ཡང་བྱུང་བར་གྱུར་ཏོ།
en: Kāśyapa, as soon as the two youths touched his feet, at that instant the great billionfold universe shook violently, and a great earthquake occurred here.

source: །འོད་སྲུང་དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེའི་བསྙེན་བཀུར་བ་ཐུབ་དཀའ་ཞེས་བྱ་བ་ཞིག་ཡོད་པར་གྱུར་པ་གང་ཡིན་པ་དེ་སྟན་ལས་ལངས་ཏེ། ཆོས་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེ་ག་ལ་བ་དེར་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། དེ་བཞིན་གཤེགས་པ་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then, Kāśyapa, an attendant of the blessed Tathāgata Myriad Flowers named Durdharṣa, who was present, rose from his seat, draped his upper shawl over one shoulder, set his right knee on the ground, and with palms joined paid homage to the blessed Tathāgata Myriad Flowers.

source: །བཅོམ་ལྡན་འདས་ལ་འཇིག་རྟེན་དུ་དོག་ས་ཆེར་གཡོས་པ་འདིའི་རྒྱུ་ནི་གང་ལགས།
en: Then, Kāśyapa, he asked the Blessed One, ‘Blessed One, what is the cause of this great earthquake?

source: རྐྱེན་ནི་གང་ལགས།
en: What brought it on?

source: ཅིའི་སླད་དུ་ན། ཁྱེའུ་འདི་གཉིས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་གཏུགས་པར་གྱུར་ལགས། འོད་སྲུང་དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Why did these two youths touch the feet of the Blessed One?’ “

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེས་བསྙེན་བཀུར་བ་ཐུབ་དཀའ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་གཏམ་དེ་ལྟ་བུ་ཡོངས་སུ་ཞུས་པས་ཁྱོད་ལ་ཅི་བྱ།
en: The Tathāgata Myriad Flowers replied to his attendant Durdharṣa, ‘Son of noble family, what is the point of you asking such questions?

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པས་ཁྱེའུ་འདི་གཉིས་ཀྱིས་ལྷག་པའི་བསམ་པ་ཇི་ལྟ་བུ་དང་། ཟབ་མོ་ལ་བཟོད་པ་སྒོམ་པ་ཇི་ལྟ་བུ་དང་སྙིང་རྗེ་ཆེན་པོ་ཇི་ལྟ་བུས་དེ་བཞིན་གཤེགས་པའི་ཞབས་གཉིས་ལ་གཏུགས་པའི་གནས་དེ་བཤད་པར་གྱུར་ན་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་འདི་རྨོངས་པར་འགྱུར་རོ།། །།༄༅། །བམ་པོ་གསུམ་པ།
en: If the Tathāgata explained the subject of the noble intention, the cultivation of acceptance of the profound, and the great compassion with which the two youths touched his feet, this world with its gods would be bewildered.’ “

source: འོད་སྲུང་དེ་ནས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེས་ཉན་ཐོས་ཆེན་པོ་རྫུ་འཕྲུལ་དང་ལྡན་པའི་མཆོག་སྲེད་མེད་ཀྱི་བུ་ཞེས་བྱ་བ་ལ་བཀའ་སྩལ་པ། སྲེད་མེད་ཀྱི་བུ་ཁྱོད་ལོངས་ལ་ཁྱེའུ་འདི་གཉིས་སློང་སྟེ་རང་གི་རྫུ་འཕྲུལ་གྱི་མཐུ་སྟོན་ཅིག །
en: Then, Kāśyapa, the Tathāgata Myriad Flowers said to a great śrāvaka named Nārāyaṇa, supreme among those who possessed miraculous powers, ‘Nārāyaṇa, take these two youths and show them the force of your miraculous power.’ “

source: འོད་སྲུང་དེ་ནས་དགེ་སློང་སྲེད་མེད་ཀྱི་བུ་དེས་དེ་ལས་ཁྱེའུ་གཅིག་ལག་པ་གཡས་པས་བླངས་ལ། ཁྱེའུ་ཅིག་ཤོས་ལག་པ་གཡོན་པས་བླངས་ཏེ་གྱེན་དུ་འཕང་ངོ་སྙམ་ན་གདེག་པར་མ་ནུས་སོ།
en: Then, Kāśyapa, Nārāyaṇa the monk took hold of one of the youths with his right hand and the other youth with his left hand, thinking that he would toss them up, but he was unable to lift them.

source: །དེས་ཡང་རྒྱ་ཆེར་མཐུ་དང་། སྟོབས་དང་། བརྩོན་འགྲུས་དང་། སྤྲོ་བ་དང་། རྫུ་འཕྲུལ་ཆེན་པོ་ཡང་དག་པར་བསྟན་ཅིང་གྱེན་དུ་འཕང་ངོ་སྙམ་ན་ཐ་ན་དེ་གཉིས་སྐྲའི་རྩེ་མོའི་ཆ་ཤས་ཙམ་ཡང་བསྐྱོད་པ་འམ་བསྒུལ་བར་མ་ནུས་སོ།
en: Again he demonstrated great force, strength, exertion, enthusiasm, and miraculous power, thinking that he would toss them up, but in the end he was unable to move or stir them even as much as a fraction of a hair tip.

source: །འོད་སྲུང་དེ་ལྟར་དེ་ཁྱེའུ་དེ་གཉིས་ཤིན་ཏུ་གྱེན་དུ་འཕང་བར་བསྐྱོད་པ་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་བྲག་དང་། རི་དང་། ཤིང་དང་། རྩྭ་དང་། ཆུ་དང་བཅས་པ་དེ་རབ་ཏུ་གཡོས་ཤིང་བླ་འོག་ཏུ་འགུལ་བར་གྱུར་ཀྱང་ཁྱེའུ་དེ་གཉིས་བསླང་བར་ནི་མ་ནུས་སོ།
en: Kāśyapa, if he had moved to toss the two youths very high, the great billionfold universe, with its crags, mountains, trees, vegetation, and rivers, would have shaken violently and stirred above and below, but he was unable to lift the two youths. “

source: །འོད་སྲུང་དེ་ནས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེས་དེའི་ཚེ་ཉན་ཐོས་ཆེན་པོ་དེའི་སེམས་ཡང་དག་པར་རབ་ཏུ་གཟུང་བ་དང་། རྫུ་འཕྲུལ་གྱི་མཐུ་ཉེ་བར་སྒྲུབ་པ་མཛད་དེ།
en: At that point, Kāśyapa, the Tathāgata Myriad Flowers took control of the great śrāvaka’s mind and caused him to exercise the force of his miraculous power.

source: རྫུ་འཕྲུལ་གྱི་མཐུ་ཉེ་བར་བསྒྲུབས་པ་དེས་དགེ་སློང་སྲེད་མེད་ཀྱི་བུ་དེས་འོག་གི་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་འགུལ་བ་དང་། གཡོས་པ་དང་། ཀུན་ཏུ་འཁྲུགས་པ་དང་།
en: Exercising the force of his miraculous power, Nārāyaṇa the monk stirred, shook, convulsed, and vibrated the buddha fields of the nadir, as numerous as the grains of sand in the Ganges.

source: བླ་འོག་ཏུ་འགུལ་བར་བྱས་ཀྱང་ཐ་ན་ཁྱེའུ་དེ་གཉིས་སྐྲའི་རྩེ་མོའི་ཆ་ཤས་ཙམ་ཡང་གཡོ་བའམ། འགུལ་བར་བྱེད་མ་ནུས་སོ།
en: But in the end, he was unable to shake or stir the two youths even as much as a fraction of a hair tip. “

source: །འོད་སྲུང་དེ་ནས་དགེ་སློང་སྲེད་མེད་ཀྱི་བུ་དེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེའི་ཞབས་གཉིས་ལ་གཏུགས་ནས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ལས་ཡོངས་སུ་ཉམས་པ་འམ་གཅིག་ཏུ་མ་གྱུར་ལགས་གྲང་།
en: Then, Kāśyapa, Nārāyaṇa the monk touched the feet of the Tathāgata Myriad Flowers and said to him, ‘Blessed One, could it be that I am losing the strength of my miraculous power, or that I do not possess it?

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་འདི་ལྟར་བདག་གིས་ཁྱེའུ་སྐྱེས་ནས་རིང་པོ་མ་ལགས་པ། བྱིས་པའི་གཟུགས་སུ་མཆིས་པ། ལུས་བོང་ཆུང་ངུ་འདི་གཉིས་ཀྱིས་དོག་ས་ལ་གཏུགས་པ་ཡང་བསླང་བར་རྔོ་མ་ཐོག་པའི་སླད་དུའོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Because, Blessed One, I am unable to lift these young boys, with their immature appearances and slight bodies, even though they are touching the ground.’ “

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེས་དགེ་སློང་སྲེད་མེད་ཀྱི་བུ་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །སྲེད་མེད་ཀྱི་བུ་ཁྱོད་ནི་རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ལས་ཡོངས་སུ་མ་ཉམས་མོད་ཀྱི། འོན་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་བྱིན་གྱི་རླབས་འདི་ནི་བསམ་གྱིས་མི་ཁྱབ་པ་ཡིན་པས་དེ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་རྣམ་པར་དཀྲུག་པ་འམ། བསམ་པར་སླ་བ་མ་ཡིན་ཏེ།
en: The blessed Tathāgata Myriad Flowers replied to Nārāyaṇa the monk, ‘Nārāyaṇa, although you have not lost the strength of your miraculous power, because this resolute power of a bodhisattva is inconceivable, it is confused by all śrāvakas and pratyekabuddhas, or it is not easy for them to conceive.

source: སྲེད་མེད་ཀྱི་བུ་གལ་ཏེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སེམས་ཅན་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་འདི་ལྟ་སྟེ་དཔེར་ན་ངས་ད་ལྟར་ཁྱོད་ཉིད་ཉན་ཐོས་རྫུ་འཕྲུལ་ཆེན་པོ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་གྱི་སྟོབས་དང་ལྡན་པར་གྱུར་ཅིང་དེ་ཙམ་དུ་རྫུ་འཕྲུལ་ཆེ་བ་དང་། དེ་ཙམ་དུ་མཐུ་ཆེ་བའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་བསྐལ་པ་བྱེ་བ་སྙེད་དུ་རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་རྣམ་པ་སྣ་ཚོགས་དག་གིས་རྣམ་པར་འཕྲུལ་པ་བྱས་ཀྱང་དེ་དག་གིས་ཁྱེའུ་འདི་གཉིས་བསླང་བ་འམ། བསྒུལ་བར་མི་ནུས་སོ།
en: Nārāyaṇa, for example, if all the beings in the great billionfold universe were endowed with the strength of miraculous power like that which I just now displayed to you as the supreme of śrāvakas who possess great miraculous power, and if they all had such great miraculous power and great strength, even if they all manifested various types of miraculous displays for ten million eons, they would be unable to lift or stir these two youths.’ “

source: །འོད་སྲུང་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེས་ཚིག་དེ་སྐད་གསུངས་པ་ན་འཁོར་དེ་ལ་སྲོག་ཆགས་འབུམ་ཕྲག་བཞི་བཅུ་རྩ་གཉིས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་རྟོགས་ཤིང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཐོབ་པ་ཁོ་ན་ཡིན་ཡང་། གང་ལ་ཉན་ཐོས་ཆེན་པོ་འདི་དག་རྡུགས་པར་བྱས་ཏེ་བཀོད་པའི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་དེ་ལྟ་བུ་དང་ལྡན་པ་དེ་ནི་ངོ་མཚར་ཏེ།
en: Kāśyapa, as the Tathāgata Myriad Flowers spoke these words, four million two hundred thousand living beings in the assembly generated the thought of unsurpassed, perfect awakening, thinking, ‘It is amazing how even bodhisattvas who have not realized omniscience, who have still not attained omniscience, have vanquished these great śrāvakas with such a magical display of their miraculous powers.

source: བདག་ཅག་གིས་ཀྱང་བྱིན་གྱི་རླབས་དེ་ལྟ་བུ་ཐོབ་པར་བྱ་བ་དང་།
en: We, too, should attain such resolute power and the wisdom of the buddhas.’

source: སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱང་ཐོབ་པར་བྱའོ་སྙམ་དུ་སེམས་ཤིང་དེ་ལྟར་ཡང་དག་པར་ཤེས་པའི་སྲོག་ཆགས་འབུམ་ཕྲག་བཞི་བཅུ་རྩ་གཉིས་པོ་དེ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏོ།
en: In that manner those four million two hundred thousand discerning living beings generated the thought of unsurpassed, perfect awakening. “

source: །འོད་སྲུང་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་བཟང་པོ་ཞེས་བྱ་བ་ཞིག་འཁོར་དེ་ཉིད་དུ་འདུས་ཏེ་འདུག་པར་གྱུར་པ་དེ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then, Kāśyapa, a bodhisattva great being named Sumati, who was seated among the retinue, rose from his seat, draped his upper shawl over one shoulder, set his right knee on the ground, and with palms joined paid homage to the blessed Tathāgata Myriad Flowers.

source: །བཅོམ་ལྡན་འདས་ཁྱེའུ་འདི་གཉིས་བསླང་བར་མཛད་ཅིང་ཁྱེའུ་འདི་གཉིས་ཀྱིས་ཞུས་པ་རབ་ཏུ་རྣམ་པར་དབྱེ་བ་ཡང་བསྟན་དུ་གསོལ།
en: Then he asked the Blessed One, ‘Blessed One, will you please lift these two youths and examine the question that they asked?’ “
